espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/pmu_reg.h
/** PMU_POWER_PD_TOP_MASK_REG register
 *  need_des
 */
#define PMU_POWER_PD_TOP_MASK_REG (DR_REG_PMU_BASE + 0x100)
/** PMU_XPD_TOP_MASK : R/W; bitpos: [4:0]; default: 0;
 *  need_des
 */
#define PMU_XPD_TOP_MASK    0x0000001FU
#define PMU_XPD_TOP_MASK_M  (PMU_XPD_TOP_MASK_V << PMU_XPD_TOP_MASK_S)
#define PMU_XPD_TOP_MASK_V  0x0000001FU
#define PMU_XPD_TOP_MASK_S  0
/** PMU_PD_TOP_MASK : R/W; bitpos: [31:27]; default: 0;
 *  need_des
 */
#define PMU_PD_TOP_MASK    0x0000001FU
#define PMU_PD_TOP_MASK_M  (PMU_PD_TOP_MASK_V << PMU_PD_TOP_MASK_S)
#define PMU_PD_TOP_MASK_V  0x0000001FU
#define PMU_PD_TOP_MASK_S  27

/** PMU_POWER_PD_CNNT_MASK_REG register
 *  need_des
 */
#define PMU_POWER_PD_CNNT_MASK_REG (DR_REG_PMU_BASE + 0x104)
/** PMU_XPD_CNNT_MASK : R/W; bitpos: [4:0]; default: 0;
 *  need_des
 */
#define PMU_XPD_CNNT_MASK    0x0000001FU
#define PMU_XPD_CNNT_MASK_M  (PMU_XPD_CNNT_MASK_V << PMU_XPD_CNNT_MASK_S)
#define PMU_XPD_CNNT_MASK_V  0x0000001FU
#define PMU_XPD_CNNT_MASK_S  0
/** PMU_PD_CNNT_MASK : R/W; bitpos: [31:27]; default: 0;
 *  need_des
 */
#define PMU_PD_CNNT_MASK    0x0000001FU
#define PMU_PD_CNNT_MASK_M  (PMU_PD_CNNT_MASK_V << PMU_PD_CNNT_MASK_S)
#define PMU_PD_CNNT_MASK_V  0x0000001FU
#define PMU_PD_CNNT_MASK_S  27

/** PMU_POWER_PD_HPMEM_MASK_REG register
 *  need_des
 */
#define PMU_POWER_PD_HPMEM_MASK_REG (DR_REG_PMU_BASE + 0x108)
/** PMU_XPD_HP_MEM_MASK : R/W; bitpos: [5:0]; default: 0;
 *  need_des
 */
#define PMU_XPD_HP_MEM_MASK    0x0000003FU
#define PMU_XPD_HP_MEM_MASK_M  (PMU_XPD_HP_MEM_MASK_V << PMU_XPD_HP_MEM_MASK_S)
#define PMU_XPD_HP_MEM_MASK_V  0x0000003FU
#define PMU_XPD_HP_MEM_MASK_S  0
/** PMU_PD_HP_MEM_MASK : R/W; bitpos: [31:26]; default: 0;
 *  need_des
 */
#define PMU_PD_HP_MEM_MASK    0x0000003FU
#define PMU_PD_HP_MEM_MASK_M  (PMU_PD_HP_MEM_MASK_V << PMU_PD_HP_MEM_MASK_S)
#define PMU_PD_HP_MEM_MASK_V  0x0000003FU
#define PMU_PD_HP_MEM_MASK_S  26

/** PMU_POWER_DCDC_SWITCH_REG register
 *  need_des
 */
#define PMU_POWER_DCDC_SWITCH_REG (DR_REG_PMU_BASE + 0x10c)
/** PMU_FORCE_DCDC_SWITCH_PU : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define PMU_FORCE_DCDC_SWITCH_PU    (BIT(0))
#define PMU_FORCE_DCDC_SWITCH_PU_M  (PMU_FORCE_DCDC_SWITCH_PU_V << PMU_FORCE_DCDC_SWITCH_PU_S)
#define PMU_FORCE_DCDC_SWITCH_PU_V  0x00000001U
#define PMU_FORCE_DCDC_SWITCH_PU_S  0
/** PMU_FORCE_DCDC_SWITCH_PD : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define PMU_FORCE_DCDC_SWITCH_PD    (BIT(1))
#define PMU_FORCE_DCDC_SWITCH_PD_M  (PMU_FORCE_DCDC_SWITCH_PD_V << PMU_FORCE_DCDC_SWITCH_PD_S)
#define PMU_FORCE_DCDC_SWITCH_PD_V  0x00000001U
#define PMU_FORCE_DCDC_SWITCH_PD_S  1

/** PMU_POWER_PD_LPPERI_CNTL_REG register
 *  need_des
 */
#define PMU_POWER_PD_LPPERI_CNTL_REG (DR_REG_PMU_BASE + 0x110)
/** PMU_FORCE_LP_PERI_RESET : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define PMU_FORCE_LP_PERI_RESET    (BIT(0))
#define PMU_FORCE_LP_PERI_RESET_M  (PMU_FORCE_LP_PERI_RESET_V << PMU_FORCE_LP_PERI_RESET_S)
#define PMU_FORCE_LP_PERI_RESET_V  0x00000001U
#define PMU_FORCE_LP_PERI_RESET_S  0
/** PMU_FORCE_LP_PERI_ISO : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define PMU_FORCE_LP_PERI_ISO    (BIT(1))
#define PMU_FORCE_LP_PERI_ISO_M  (PMU_FORCE_LP_PERI_ISO_V << PMU_FORCE_LP_PERI_ISO_S)
#define PMU_FORCE_LP_PERI_ISO_V  0x00000001U
#define PMU_FORCE_LP_PERI_ISO_S  1
/** PMU_FORCE_LP_PERI_PU : R/W; bitpos: [2]; default: 1;
 *  need_des
 */
#define PMU_FORCE_LP_PERI_PU    (BIT(2))
#define PMU_FORCE_LP_PERI_PU_M  (PMU_FORCE_LP_PERI_PU_V << PMU_FORCE_LP_PERI_PU_S)
#define PMU_FORCE_LP_PERI_PU_V  0x00000001U
#define PMU_FORCE_LP_PERI_PU_S  2
/** PMU_FORCE_LP_PERI_NO_RESET : R/W; bitpos: [3]; default: 1;
 *  need_des
 */
#define PMU_FORCE_LP_PERI_NO_RESET    (BIT(3))
#define PMU_FORCE_LP_PERI_NO_RESET_M  (PMU_FORCE_LP_PERI_NO_RESET_V << PMU_FORCE_LP_PERI_NO_RESET_S)
#define PMU_FORCE_LP_PERI_NO_RESET_V  0x00000001U
#define PMU_FORCE_LP_PERI_NO_RESET_S  3
/** PMU_FORCE_LP_PERI_NO_ISO : R/W; bitpos: [4]; default: 1;
 *  need_des
 */
#define PMU_FORCE_LP_PERI_NO_ISO    (BIT(4))
#define PMU_FORCE_LP_PERI_NO_ISO_M  (PMU_FORCE_LP_PERI_NO_ISO_V << PMU_FORCE_LP_PERI_NO_ISO_S)
#define PMU_FORCE_LP_PERI_NO_ISO_V  0x00000001U
#define PMU_FORCE_LP_PERI_NO_ISO_S  4
/** PMU_FORCE_LP_PERI_PD : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define PMU_FORCE_LP_PERI_PD    (BIT(5))
#define PMU_FORCE_LP_PERI_PD_M  (PMU_FORCE_LP_PERI_PD_V << PMU_FORCE_LP_PERI_PD_S)
#define PMU_FORCE_LP_PERI_PD_V  0x00000001U
#define PMU_FORCE_LP_PERI_PD_S  5

/** PMU_POWER_PD_LPPERI_MASK_REG register
 *  need_des
 */
#define PMU_POWER_PD_LPPERI_MASK_REG (DR_REG_PMU_BASE + 0x114)
/** PMU_XPD_LP_PERI_MASK : R/W; bitpos: [4:0]; default: 0;
 *  need_des
 */
#define PMU_XPD_LP_PERI_MASK    0x0000001FU
#define PMU_XPD_LP_PERI_MASK_M  (PMU_XPD_LP_PERI_MASK_V << PMU_XPD_LP_PERI_MASK_S)
#define PMU_XPD_LP_PERI_MASK_V  0x0000001FU
#define PMU_XPD_LP_PERI_MASK_S  0
/** PMU_PD_LP_PERI_MASK : R/W; bitpos: [31:27]; default: 0;
 *  need_des
 */
#define PMU_PD_LP_PERI_MASK    0x0000001FU
#define PMU_PD_LP_PERI_MASK_M  (PMU_PD_LP_PERI_MASK_V << PMU_PD_LP_PERI_MASK_S)
#define PMU_PD_LP_PERI_MASK_V  0x0000001FU
#define PMU_PD_LP_PERI_MASK_S  27

/** PMU_POWER_HP_PAD_REG register
 *  need_des
 */
#define PMU_POWER_HP_PAD_REG (DR_REG_PMU_BASE + 0x118)
/** PMU_FORCE_HP_PAD_NO_ISO_ALL : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define PMU_FORCE_HP_PAD_NO_ISO_ALL    (BIT(0))
#define PMU_FORCE_HP_PAD_NO_ISO_ALL_M  (PMU_FORCE_HP_PAD_NO_ISO_ALL_V << PMU_FORCE_HP_PAD_NO_ISO_ALL_S)
#define PMU_FORCE_HP_PAD_NO_ISO_ALL_V  0x00000001U
#define PMU_FORCE_HP_PAD_NO_ISO_ALL_S  0
/** PMU_FORCE_HP_PAD_ISO_ALL : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define PMU_FORCE_HP_PAD_ISO_ALL    (BIT(1))
#define PMU_FORCE_HP_PAD_ISO_ALL_M  (PMU_FORCE_HP_PAD_ISO_ALL_V << PMU_FORCE_HP_PAD_ISO_ALL_S)
#define PMU_FORCE_HP_PAD_ISO_ALL_V  0x00000001U
#define PMU_FORCE_HP_PAD_ISO_ALL_S  1

/** PMU_POWER_CK_WAIT_CNTL_REG register
 *  need_des
 */
#define PMU_POWER_CK_WAIT_CNTL_REG (DR_REG_PMU_BASE + 0x11c)
/** PMU_PMU_WAIT_XTL_STABLE : R/W; bitpos: [15:0]; default: 256;
 *  need_des
 */
#define PMU_PMU_WAIT_XTL_STABLE    0x0000FFFFU
#define PMU_PMU_WAIT_XTL_STABLE_M  (PMU_PMU_WAIT_XTL_STABLE_V << PMU_PMU_WAIT_XTL_STABLE_S)
#define PMU_PMU_WAIT_XTL_STABLE_V  0x0000FFFFU
#define PMU_PMU_WAIT_XTL_STABLE_S  0
/** PMU_PMU_WAIT_PLL_STABLE : R/W; bitpos: [31:16]; default: 256;
 *  need_des
 */
#define PMU_PMU_WAIT_PLL_STABLE    0x0000FFFFU
#define PMU_PMU_WAIT_PLL_STABLE_M  (PMU_PMU_WAIT_PLL_STABLE_V << PMU_PMU_WAIT_PLL_STABLE_S)
#define PMU_PMU_WAIT_PLL_STABLE_V  0x0000FFFFU
#define PMU_PMU_WAIT_PLL_STABLE_S  16

