espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/pmu_reg.h
/** PMU_CLK_STATE2_REG register
 *  need_des
 */
#define PMU_CLK_STATE2_REG (DR_REG_PMU_BASE + 0x1b4)
/** PMU_PMU_ICG_APB_EN_STATE : RO; bitpos: [31:0]; default: 4294967295;
 *  need_des
 */
#define PMU_PMU_ICG_APB_EN_STATE    0xFFFFFFFFU
#define PMU_PMU_ICG_APB_EN_STATE_M  (PMU_PMU_ICG_APB_EN_STATE_V << PMU_PMU_ICG_APB_EN_STATE_S)
#define PMU_PMU_ICG_APB_EN_STATE_V  0xFFFFFFFFU
#define PMU_PMU_ICG_APB_EN_STATE_S  0

/** PMU_EXT_LDO_P0_0P1A_REG register
 *  need_des
 */
#define PMU_EXT_LDO_P0_0P1A_REG (DR_REG_PMU_BASE + 0x1b8)
/** PMU_0P1A_FORCE_TIEH_SEL_0 : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define PMU_0P1A_FORCE_TIEH_SEL_0    (BIT(7))
#define PMU_0P1A_FORCE_TIEH_SEL_0_M  (PMU_0P1A_FORCE_TIEH_SEL_0_V << PMU_0P1A_FORCE_TIEH_SEL_0_S)
#define PMU_0P1A_FORCE_TIEH_SEL_0_V  0x00000001U
#define PMU_0P1A_FORCE_TIEH_SEL_0_S  7
/** PMU_0P1A_XPD_0 : R/W; bitpos: [8]; default: 1;
 *  need_des
 */
#define PMU_0P1A_XPD_0    (BIT(8))
#define PMU_0P1A_XPD_0_M  (PMU_0P1A_XPD_0_V << PMU_0P1A_XPD_0_S)
#define PMU_0P1A_XPD_0_V  0x00000001U
#define PMU_0P1A_XPD_0_S  8
/** PMU_0P1A_TIEH_SEL_0 : R/W; bitpos: [11:9]; default: 0;
 *  need_des
 */
#define PMU_0P1A_TIEH_SEL_0    0x00000007U
#define PMU_0P1A_TIEH_SEL_0_M  (PMU_0P1A_TIEH_SEL_0_V << PMU_0P1A_TIEH_SEL_0_S)
#define PMU_0P1A_TIEH_SEL_0_V  0x00000007U
#define PMU_0P1A_TIEH_SEL_0_S  9
/** PMU_0P1A_TIEH_POS_EN_0 : R/W; bitpos: [12]; default: 0;
 *  need_des
 */
#define PMU_0P1A_TIEH_POS_EN_0    (BIT(12))
#define PMU_0P1A_TIEH_POS_EN_0_M  (PMU_0P1A_TIEH_POS_EN_0_V << PMU_0P1A_TIEH_POS_EN_0_S)
#define PMU_0P1A_TIEH_POS_EN_0_V  0x00000001U
#define PMU_0P1A_TIEH_POS_EN_0_S  12
/** PMU_0P1A_TIEH_NEG_EN_0 : R/W; bitpos: [13]; default: 0;
 *  need_des
 */
#define PMU_0P1A_TIEH_NEG_EN_0    (BIT(13))
#define PMU_0P1A_TIEH_NEG_EN_0_M  (PMU_0P1A_TIEH_NEG_EN_0_V << PMU_0P1A_TIEH_NEG_EN_0_S)
#define PMU_0P1A_TIEH_NEG_EN_0_V  0x00000001U
#define PMU_0P1A_TIEH_NEG_EN_0_S  13
/** PMU_0P1A_TIEH_0 : R/W; bitpos: [14]; default: 0;
 *  need_des
 */
#define PMU_0P1A_TIEH_0    (BIT(14))
#define PMU_0P1A_TIEH_0_M  (PMU_0P1A_TIEH_0_V << PMU_0P1A_TIEH_0_S)
#define PMU_0P1A_TIEH_0_V  0x00000001U
#define PMU_0P1A_TIEH_0_S  14
/** PMU_0P1A_TARGET1_0 : R/W; bitpos: [22:15]; default: 64;
 *  need_des
 */
#define PMU_0P1A_TARGET1_0    0x000000FFU
#define PMU_0P1A_TARGET1_0_M  (PMU_0P1A_TARGET1_0_V << PMU_0P1A_TARGET1_0_S)
#define PMU_0P1A_TARGET1_0_V  0x000000FFU
#define PMU_0P1A_TARGET1_0_S  15
/** PMU_0P1A_TARGET0_0 : R/W; bitpos: [30:23]; default: 128;
 *  need_des
 */
#define PMU_0P1A_TARGET0_0    0x000000FFU
#define PMU_0P1A_TARGET0_0_M  (PMU_0P1A_TARGET0_0_V << PMU_0P1A_TARGET0_0_S)
#define PMU_0P1A_TARGET0_0_V  0x000000FFU
#define PMU_0P1A_TARGET0_0_S  23
/** PMU_0P1A_LDO_CNT_PRESCALER_SEL_0 : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_0P1A_LDO_CNT_PRESCALER_SEL_0    (BIT(31))
#define PMU_0P1A_LDO_CNT_PRESCALER_SEL_0_M  (PMU_0P1A_LDO_CNT_PRESCALER_SEL_0_V << PMU_0P1A_LDO_CNT_PRESCALER_SEL_0_S)
#define PMU_0P1A_LDO_CNT_PRESCALER_SEL_0_V  0x00000001U
#define PMU_0P1A_LDO_CNT_PRESCALER_SEL_0_S  31

/** PMU_EXT_LDO_P0_0P1A_ANA_REG register
 *  need_des
 */
#define PMU_EXT_LDO_P0_0P1A_ANA_REG (DR_REG_PMU_BASE + 0x1bc)
/** PMU_ANA_0P1A_MUL_0 : R/W; bitpos: [25:23]; default: 2;
 *  need_des
 */
#define PMU_ANA_0P1A_MUL_0    0x00000007U
#define PMU_ANA_0P1A_MUL_0_M  (PMU_ANA_0P1A_MUL_0_V << PMU_ANA_0P1A_MUL_0_S)
#define PMU_ANA_0P1A_MUL_0_V  0x00000007U
#define PMU_ANA_0P1A_MUL_0_S  23
/** PMU_ANA_0P1A_EN_VDET_0 : R/W; bitpos: [26]; default: 0;
 *  need_des
 */
#define PMU_ANA_0P1A_EN_VDET_0    (BIT(26))
#define PMU_ANA_0P1A_EN_VDET_0_M  (PMU_ANA_0P1A_EN_VDET_0_V << PMU_ANA_0P1A_EN_VDET_0_S)
#define PMU_ANA_0P1A_EN_VDET_0_V  0x00000001U
#define PMU_ANA_0P1A_EN_VDET_0_S  26
/** PMU_ANA_0P1A_EN_CUR_LIM_0 : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define PMU_ANA_0P1A_EN_CUR_LIM_0    (BIT(27))
#define PMU_ANA_0P1A_EN_CUR_LIM_0_M  (PMU_ANA_0P1A_EN_CUR_LIM_0_V << PMU_ANA_0P1A_EN_CUR_LIM_0_S)
#define PMU_ANA_0P1A_EN_CUR_LIM_0_V  0x00000001U
#define PMU_ANA_0P1A_EN_CUR_LIM_0_S  27
/** PMU_ANA_0P1A_DREF_0 : R/W; bitpos: [31:28]; default: 11;
 *  need_des
 */
#define PMU_ANA_0P1A_DREF_0    0x0000000FU
#define PMU_ANA_0P1A_DREF_0_M  (PMU_ANA_0P1A_DREF_0_V << PMU_ANA_0P1A_DREF_0_S)
#define PMU_ANA_0P1A_DREF_0_V  0x0000000FU
#define PMU_ANA_0P1A_DREF_0_S  28

/** PMU_EXT_LDO_P0_0P2A_REG register
 *  need_des
 */
#define PMU_EXT_LDO_P0_0P2A_REG (DR_REG_PMU_BASE + 0x1c0)
/** PMU_0P2A_FORCE_TIEH_SEL_0 : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define PMU_0P2A_FORCE_TIEH_SEL_0    (BIT(7))
#define PMU_0P2A_FORCE_TIEH_SEL_0_M  (PMU_0P2A_FORCE_TIEH_SEL_0_V << PMU_0P2A_FORCE_TIEH_SEL_0_S)
#define PMU_0P2A_FORCE_TIEH_SEL_0_V  0x00000001U
#define PMU_0P2A_FORCE_TIEH_SEL_0_S  7
/** PMU_0P2A_XPD_0 : R/W; bitpos: [8]; default: 0;
 *  need_des
 */
#define PMU_0P2A_XPD_0    (BIT(8))
#define PMU_0P2A_XPD_0_M  (PMU_0P2A_XPD_0_V << PMU_0P2A_XPD_0_S)
#define PMU_0P2A_XPD_0_V  0x00000001U
#define PMU_0P2A_XPD_0_S  8
/** PMU_0P2A_TIEH_SEL_0 : R/W; bitpos: [11:9]; default: 0;
 *  need_des
 */
#define PMU_0P2A_TIEH_SEL_0    0x00000007U
#define PMU_0P2A_TIEH_SEL_0_M  (PMU_0P2A_TIEH_SEL_0_V << PMU_0P2A_TIEH_SEL_0_S)
#define PMU_0P2A_TIEH_SEL_0_V  0x00000007U
#define PMU_0P2A_TIEH_SEL_0_S  9
/** PMU_0P2A_TIEH_POS_EN_0 : R/W; bitpos: [12]; default: 0;
 *  need_des
 */
#define PMU_0P2A_TIEH_POS_EN_0    (BIT(12))
#define PMU_0P2A_TIEH_POS_EN_0_M  (PMU_0P2A_TIEH_POS_EN_0_V << PMU_0P2A_TIEH_POS_EN_0_S)
#define PMU_0P2A_TIEH_POS_EN_0_V  0x00000001U
#define PMU_0P2A_TIEH_POS_EN_0_S  12
/** PMU_0P2A_TIEH_NEG_EN_0 : R/W; bitpos: [13]; default: 0;
 *  need_des
 */
#define PMU_0P2A_TIEH_NEG_EN_0    (BIT(13))
#define PMU_0P2A_TIEH_NEG_EN_0_M  (PMU_0P2A_TIEH_NEG_EN_0_V << PMU_0P2A_TIEH_NEG_EN_0_S)
#define PMU_0P2A_TIEH_NEG_EN_0_V  0x00000001U
#define PMU_0P2A_TIEH_NEG_EN_0_S  13
/** PMU_0P2A_TIEH_0 : R/W; bitpos: [14]; default: 0;
 *  need_des
 */
#define PMU_0P2A_TIEH_0    (BIT(14))
#define PMU_0P2A_TIEH_0_M  (PMU_0P2A_TIEH_0_V << PMU_0P2A_TIEH_0_S)
#define PMU_0P2A_TIEH_0_V  0x00000001U
#define PMU_0P2A_TIEH_0_S  14
/** PMU_0P2A_TARGET1_0 : R/W; bitpos: [22:15]; default: 64;
 *  need_des
 */
#define PMU_0P2A_TARGET1_0    0x000000FFU
#define PMU_0P2A_TARGET1_0_M  (PMU_0P2A_TARGET1_0_V << PMU_0P2A_TARGET1_0_S)
#define PMU_0P2A_TARGET1_0_V  0x000000FFU
#define PMU_0P2A_TARGET1_0_S  15
/** PMU_0P2A_TARGET0_0 : R/W; bitpos: [30:23]; default: 128;
 *  need_des
 */
#define PMU_0P2A_TARGET0_0    0x000000FFU
#define PMU_0P2A_TARGET0_0_M  (PMU_0P2A_TARGET0_0_V << PMU_0P2A_TARGET0_0_S)
#define PMU_0P2A_TARGET0_0_V  0x000000FFU
#define PMU_0P2A_TARGET0_0_S  23
/** PMU_0P2A_LDO_CNT_PRESCALER_SEL_0 : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_0P2A_LDO_CNT_PRESCALER_SEL_0    (BIT(31))
#define PMU_0P2A_LDO_CNT_PRESCALER_SEL_0_M  (PMU_0P2A_LDO_CNT_PRESCALER_SEL_0_V << PMU_0P2A_LDO_CNT_PRESCALER_SEL_0_S)
#define PMU_0P2A_LDO_CNT_PRESCALER_SEL_0_V  0x00000001U
#define PMU_0P2A_LDO_CNT_PRESCALER_SEL_0_S  31

/** PMU_EXT_LDO_P0_0P2A_ANA_REG register
 *  need_des
 */
#define PMU_EXT_LDO_P0_0P2A_ANA_REG (DR_REG_PMU_BASE + 0x1c4)
/** PMU_ANA_0P2A_MUL_0 : R/W; bitpos: [25:23]; default: 0;
 *  need_des
 */
#define PMU_ANA_0P2A_MUL_0    0x00000007U
#define PMU_ANA_0P2A_MUL_0_M  (PMU_ANA_0P2A_MUL_0_V << PMU_ANA_0P2A_MUL_0_S)
#define PMU_ANA_0P2A_MUL_0_V  0x00000007U
#define PMU_ANA_0P2A_MUL_0_S  23
/** PMU_ANA_0P2A_EN_VDET_0 : R/W; bitpos: [26]; default: 0;
 *  need_des
 */
#define PMU_ANA_0P2A_EN_VDET_0    (BIT(26))
#define PMU_ANA_0P2A_EN_VDET_0_M  (PMU_ANA_0P2A_EN_VDET_0_V << PMU_ANA_0P2A_EN_VDET_0_S)
#define PMU_ANA_0P2A_EN_VDET_0_V  0x00000001U
#define PMU_ANA_0P2A_EN_VDET_0_S  26
/** PMU_ANA_0P2A_EN_CUR_LIM_0 : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define PMU_ANA_0P2A_EN_CUR_LIM_0    (BIT(27))
#define PMU_ANA_0P2A_EN_CUR_LIM_0_M  (PMU_ANA_0P2A_EN_CUR_LIM_0_V << PMU_ANA_0P2A_EN_CUR_LIM_0_S)
#define PMU_ANA_0P2A_EN_CUR_LIM_0_V  0x00000001U
#define PMU_ANA_0P2A_EN_CUR_LIM_0_S  27
/** PMU_ANA_0P2A_DREF_0 : R/W; bitpos: [31:28]; default: 10;
 *  need_des
 */
#define PMU_ANA_0P2A_DREF_0    0x0000000FU
#define PMU_ANA_0P2A_DREF_0_M  (PMU_ANA_0P2A_DREF_0_V << PMU_ANA_0P2A_DREF_0_S)
#define PMU_ANA_0P2A_DREF_0_V  0x0000000FU
#define PMU_ANA_0P2A_DREF_0_S  28

/** PMU_EXT_LDO_P0_0P3A_REG register
 *  need_des
 */
#define PMU_EXT_LDO_P0_0P3A_REG (DR_REG_PMU_BASE + 0x1c8)
/** PMU_0P3A_FORCE_TIEH_SEL_0 : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define PMU_0P3A_FORCE_TIEH_SEL_0    (BIT(7))
#define PMU_0P3A_FORCE_TIEH_SEL_0_M  (PMU_0P3A_FORCE_TIEH_SEL_0_V << PMU_0P3A_FORCE_TIEH_SEL_0_S)
#define PMU_0P3A_FORCE_TIEH_SEL_0_V  0x00000001U
#define PMU_0P3A_FORCE_TIEH_SEL_0_S  7
/** PMU_0P3A_XPD_0 : R/W; bitpos: [8]; default: 0;
 *  need_des
 */
#define PMU_0P3A_XPD_0    (BIT(8))
#define PMU_0P3A_XPD_0_M  (PMU_0P3A_XPD_0_V << PMU_0P3A_XPD_0_S)
#define PMU_0P3A_XPD_0_V  0x00000001U
#define PMU_0P3A_XPD_0_S  8
/** PMU_0P3A_TIEH_SEL_0 : R/W; bitpos: [11:9]; default: 0;
 *  need_des
 */
#define PMU_0P3A_TIEH_SEL_0    0x00000007U
#define PMU_0P3A_TIEH_SEL_0_M  (PMU_0P3A_TIEH_SEL_0_V << PMU_0P3A_TIEH_SEL_0_S)
#define PMU_0P3A_TIEH_SEL_0_V  0x00000007U
#define PMU_0P3A_TIEH_SEL_0_S  9
/** PMU_0P3A_TIEH_POS_EN_0 : R/W; bitpos: [12]; default: 0;
 *  need_des
 */
#define PMU_0P3A_TIEH_POS_EN_0    (BIT(12))
#define PMU_0P3A_TIEH_POS_EN_0_M  (PMU_0P3A_TIEH_POS_EN_0_V << PMU_0P3A_TIEH_POS_EN_0_S)
#define PMU_0P3A_TIEH_POS_EN_0_V  0x00000001U
#define PMU_0P3A_TIEH_POS_EN_0_S  12
/** PMU_0P3A_TIEH_NEG_EN_0 : R/W; bitpos: [13]; default: 0;
 *  need_des
 */
#define PMU_0P3A_TIEH_NEG_EN_0    (BIT(13))
#define PMU_0P3A_TIEH_NEG_EN_0_M  (PMU_0P3A_TIEH_NEG_EN_0_V << PMU_0P3A_TIEH_NEG_EN_0_S)
#define PMU_0P3A_TIEH_NEG_EN_0_V  0x00000001U
#define PMU_0P3A_TIEH_NEG_EN_0_S  13
/** PMU_0P3A_TIEH_0 : R/W; bitpos: [14]; default: 0;
 *  need_des
 */
#define PMU_0P3A_TIEH_0    (BIT(14))
#define PMU_0P3A_TIEH_0_M  (PMU_0P3A_TIEH_0_V << PMU_0P3A_TIEH_0_S)
#define PMU_0P3A_TIEH_0_V  0x00000001U
#define PMU_0P3A_TIEH_0_S  14
/** PMU_0P3A_TARGET1_0 : R/W; bitpos: [22:15]; default: 64;
 *  need_des
 */
#define PMU_0P3A_TARGET1_0    0x000000FFU
#define PMU_0P3A_TARGET1_0_M  (PMU_0P3A_TARGET1_0_V << PMU_0P3A_TARGET1_0_S)
#define PMU_0P3A_TARGET1_0_V  0x000000FFU
#define PMU_0P3A_TARGET1_0_S  15
/** PMU_0P3A_TARGET0_0 : R/W; bitpos: [30:23]; default: 128;
 *  need_des
 */
#define PMU_0P3A_TARGET0_0    0x000000FFU
#define PMU_0P3A_TARGET0_0_M  (PMU_0P3A_TARGET0_0_V << PMU_0P3A_TARGET0_0_S)
#define PMU_0P3A_TARGET0_0_V  0x000000FFU
#define PMU_0P3A_TARGET0_0_S  23
/** PMU_0P3A_LDO_CNT_PRESCALER_SEL_0 : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_0P3A_LDO_CNT_PRESCALER_SEL_0    (BIT(31))
#define PMU_0P3A_LDO_CNT_PRESCALER_SEL_0_M  (PMU_0P3A_LDO_CNT_PRESCALER_SEL_0_V << PMU_0P3A_LDO_CNT_PRESCALER_SEL_0_S)
#define PMU_0P3A_LDO_CNT_PRESCALER_SEL_0_V  0x00000001U
#define PMU_0P3A_LDO_CNT_PRESCALER_SEL_0_S  31

/** PMU_EXT_LDO_P0_0P3A_ANA_REG register
 *  need_des
 */
#define PMU_EXT_LDO_P0_0P3A_ANA_REG (DR_REG_PMU_BASE + 0x1cc)
/** PMU_ANA_0P3A_MUL_0 : R/W; bitpos: [25:23]; default: 0;
 *  need_des
 */
#define PMU_ANA_0P3A_MUL_0    0x00000007U
#define PMU_ANA_0P3A_MUL_0_M  (PMU_ANA_0P3A_MUL_0_V << PMU_ANA_0P3A_MUL_0_S)
#define PMU_ANA_0P3A_MUL_0_V  0x00000007U
#define PMU_ANA_0P3A_MUL_0_S  23
/** PMU_ANA_0P3A_EN_VDET_0 : R/W; bitpos: [26]; default: 0;
 *  need_des
 */
#define PMU_ANA_0P3A_EN_VDET_0    (BIT(26))
#define PMU_ANA_0P3A_EN_VDET_0_M  (PMU_ANA_0P3A_EN_VDET_0_V << PMU_ANA_0P3A_EN_VDET_0_S)
#define PMU_ANA_0P3A_EN_VDET_0_V  0x00000001U
#define PMU_ANA_0P3A_EN_VDET_0_S  26
/** PMU_ANA_0P3A_EN_CUR_LIM_0 : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define PMU_ANA_0P3A_EN_CUR_LIM_0    (BIT(27))
#define PMU_ANA_0P3A_EN_CUR_LIM_0_M  (PMU_ANA_0P3A_EN_CUR_LIM_0_V << PMU_ANA_0P3A_EN_CUR_LIM_0_S)
#define PMU_ANA_0P3A_EN_CUR_LIM_0_V  0x00000001U
#define PMU_ANA_0P3A_EN_CUR_LIM_0_S  27
/** PMU_ANA_0P3A_DREF_0 : R/W; bitpos: [31:28]; default: 10;
 *  need_des
 */
#define PMU_ANA_0P3A_DREF_0    0x0000000FU
#define PMU_ANA_0P3A_DREF_0_M  (PMU_ANA_0P3A_DREF_0_V << PMU_ANA_0P3A_DREF_0_S)
#define PMU_ANA_0P3A_DREF_0_V  0x0000000FU
#define PMU_ANA_0P3A_DREF_0_S  28

/** PMU_EXT_LDO_P1_0P1A_REG register
 *  need_des
 */
#define PMU_EXT_LDO_P1_0P1A_REG (DR_REG_PMU_BASE + 0x1d0)
/** PMU_0P1A_FORCE_TIEH_SEL_1 : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define PMU_0P1A_FORCE_TIEH_SEL_1    (BIT(7))
#define PMU_0P1A_FORCE_TIEH_SEL_1_M  (PMU_0P1A_FORCE_TIEH_SEL_1_V << PMU_0P1A_FORCE_TIEH_SEL_1_S)
#define PMU_0P1A_FORCE_TIEH_SEL_1_V  0x00000001U
#define PMU_0P1A_FORCE_TIEH_SEL_1_S  7
/** PMU_0P1A_XPD_1 : R/W; bitpos: [8]; default: 0;
 *  need_des
 */
#define PMU_0P1A_XPD_1    (BIT(8))
#define PMU_0P1A_XPD_1_M  (PMU_0P1A_XPD_1_V << PMU_0P1A_XPD_1_S)
#define PMU_0P1A_XPD_1_V  0x00000001U
#define PMU_0P1A_XPD_1_S  8
/** PMU_0P1A_TIEH_SEL_1 : R/W; bitpos: [11:9]; default: 0;
 *  need_des
 */
#define PMU_0P1A_TIEH_SEL_1    0x00000007U
#define PMU_0P1A_TIEH_SEL_1_M  (PMU_0P1A_TIEH_SEL_1_V << PMU_0P1A_TIEH_SEL_1_S)
#define PMU_0P1A_TIEH_SEL_1_V  0x00000007U
#define PMU_0P1A_TIEH_SEL_1_S  9
/** PMU_0P1A_TIEH_POS_EN_1 : R/W; bitpos: [12]; default: 0;
 *  need_des
 */
#define PMU_0P1A_TIEH_POS_EN_1    (BIT(12))
#define PMU_0P1A_TIEH_POS_EN_1_M  (PMU_0P1A_TIEH_POS_EN_1_V << PMU_0P1A_TIEH_POS_EN_1_S)
#define PMU_0P1A_TIEH_POS_EN_1_V  0x00000001U
#define PMU_0P1A_TIEH_POS_EN_1_S  12
/** PMU_0P1A_TIEH_NEG_EN_1 : R/W; bitpos: [13]; default: 0;
 *  need_des
 */
#define PMU_0P1A_TIEH_NEG_EN_1    (BIT(13))
#define PMU_0P1A_TIEH_NEG_EN_1_M  (PMU_0P1A_TIEH_NEG_EN_1_V << PMU_0P1A_TIEH_NEG_EN_1_S)
#define PMU_0P1A_TIEH_NEG_EN_1_V  0x00000001U
#define PMU_0P1A_TIEH_NEG_EN_1_S  13
/** PMU_0P1A_TIEH_1 : R/W; bitpos: [14]; default: 0;
 *  need_des
 */
#define PMU_0P1A_TIEH_1    (BIT(14))
#define PMU_0P1A_TIEH_1_M  (PMU_0P1A_TIEH_1_V << PMU_0P1A_TIEH_1_S)
#define PMU_0P1A_TIEH_1_V  0x00000001U
#define PMU_0P1A_TIEH_1_S  14
/** PMU_0P1A_TARGET1_1 : R/W; bitpos: [22:15]; default: 64;
 *  need_des
 */
#define PMU_0P1A_TARGET1_1    0x000000FFU
#define PMU_0P1A_TARGET1_1_M  (PMU_0P1A_TARGET1_1_V << PMU_0P1A_TARGET1_1_S)
#define PMU_0P1A_TARGET1_1_V  0x000000FFU
#define PMU_0P1A_TARGET1_1_S  15
/** PMU_0P1A_TARGET0_1 : R/W; bitpos: [30:23]; default: 128;
 *  need_des
 */
#define PMU_0P1A_TARGET0_1    0x000000FFU
#define PMU_0P1A_TARGET0_1_M  (PMU_0P1A_TARGET0_1_V << PMU_0P1A_TARGET0_1_S)
#define PMU_0P1A_TARGET0_1_V  0x000000FFU
#define PMU_0P1A_TARGET0_1_S  23
/** PMU_0P1A_LDO_CNT_PRESCALER_SEL_1 : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_0P1A_LDO_CNT_PRESCALER_SEL_1    (BIT(31))
#define PMU_0P1A_LDO_CNT_PRESCALER_SEL_1_M  (PMU_0P1A_LDO_CNT_PRESCALER_SEL_1_V << PMU_0P1A_LDO_CNT_PRESCALER_SEL_1_S)
#define PMU_0P1A_LDO_CNT_PRESCALER_SEL_1_V  0x00000001U
#define PMU_0P1A_LDO_CNT_PRESCALER_SEL_1_S  31

