espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/pmu_reg.h
/** PMU_EXT_LDO_P1_0P1A_ANA_REG register
 *  need_des
 */
#define PMU_EXT_LDO_P1_0P1A_ANA_REG (DR_REG_PMU_BASE + 0x1d4)
/** PMU_ANA_0P1A_MUL_1 : R/W; bitpos: [25:23]; default: 0;
 *  need_des
 */
#define PMU_ANA_0P1A_MUL_1    0x00000007U
#define PMU_ANA_0P1A_MUL_1_M  (PMU_ANA_0P1A_MUL_1_V << PMU_ANA_0P1A_MUL_1_S)
#define PMU_ANA_0P1A_MUL_1_V  0x00000007U
#define PMU_ANA_0P1A_MUL_1_S  23
/** PMU_ANA_0P1A_EN_VDET_1 : R/W; bitpos: [26]; default: 0;
 *  need_des
 */
#define PMU_ANA_0P1A_EN_VDET_1    (BIT(26))
#define PMU_ANA_0P1A_EN_VDET_1_M  (PMU_ANA_0P1A_EN_VDET_1_V << PMU_ANA_0P1A_EN_VDET_1_S)
#define PMU_ANA_0P1A_EN_VDET_1_V  0x00000001U
#define PMU_ANA_0P1A_EN_VDET_1_S  26
/** PMU_ANA_0P1A_EN_CUR_LIM_1 : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define PMU_ANA_0P1A_EN_CUR_LIM_1    (BIT(27))
#define PMU_ANA_0P1A_EN_CUR_LIM_1_M  (PMU_ANA_0P1A_EN_CUR_LIM_1_V << PMU_ANA_0P1A_EN_CUR_LIM_1_S)
#define PMU_ANA_0P1A_EN_CUR_LIM_1_V  0x00000001U
#define PMU_ANA_0P1A_EN_CUR_LIM_1_S  27
/** PMU_ANA_0P1A_DREF_1 : R/W; bitpos: [31:28]; default: 10;
 *  need_des
 */
#define PMU_ANA_0P1A_DREF_1    0x0000000FU
#define PMU_ANA_0P1A_DREF_1_M  (PMU_ANA_0P1A_DREF_1_V << PMU_ANA_0P1A_DREF_1_S)
#define PMU_ANA_0P1A_DREF_1_V  0x0000000FU
#define PMU_ANA_0P1A_DREF_1_S  28

/** PMU_EXT_LDO_P1_0P2A_REG register
 *  need_des
 */
#define PMU_EXT_LDO_P1_0P2A_REG (DR_REG_PMU_BASE + 0x1d8)
/** PMU_0P2A_FORCE_TIEH_SEL_1 : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define PMU_0P2A_FORCE_TIEH_SEL_1    (BIT(7))
#define PMU_0P2A_FORCE_TIEH_SEL_1_M  (PMU_0P2A_FORCE_TIEH_SEL_1_V << PMU_0P2A_FORCE_TIEH_SEL_1_S)
#define PMU_0P2A_FORCE_TIEH_SEL_1_V  0x00000001U
#define PMU_0P2A_FORCE_TIEH_SEL_1_S  7
/** PMU_0P2A_XPD_1 : R/W; bitpos: [8]; default: 0;
 *  need_des
 */
#define PMU_0P2A_XPD_1    (BIT(8))
#define PMU_0P2A_XPD_1_M  (PMU_0P2A_XPD_1_V << PMU_0P2A_XPD_1_S)
#define PMU_0P2A_XPD_1_V  0x00000001U
#define PMU_0P2A_XPD_1_S  8
/** PMU_0P2A_TIEH_SEL_1 : R/W; bitpos: [11:9]; default: 0;
 *  need_des
 */
#define PMU_0P2A_TIEH_SEL_1    0x00000007U
#define PMU_0P2A_TIEH_SEL_1_M  (PMU_0P2A_TIEH_SEL_1_V << PMU_0P2A_TIEH_SEL_1_S)
#define PMU_0P2A_TIEH_SEL_1_V  0x00000007U
#define PMU_0P2A_TIEH_SEL_1_S  9
/** PMU_0P2A_TIEH_POS_EN_1 : R/W; bitpos: [12]; default: 0;
 *  need_des
 */
#define PMU_0P2A_TIEH_POS_EN_1    (BIT(12))
#define PMU_0P2A_TIEH_POS_EN_1_M  (PMU_0P2A_TIEH_POS_EN_1_V << PMU_0P2A_TIEH_POS_EN_1_S)
#define PMU_0P2A_TIEH_POS_EN_1_V  0x00000001U
#define PMU_0P2A_TIEH_POS_EN_1_S  12
/** PMU_0P2A_TIEH_NEG_EN_1 : R/W; bitpos: [13]; default: 0;
 *  need_des
 */
#define PMU_0P2A_TIEH_NEG_EN_1    (BIT(13))
#define PMU_0P2A_TIEH_NEG_EN_1_M  (PMU_0P2A_TIEH_NEG_EN_1_V << PMU_0P2A_TIEH_NEG_EN_1_S)
#define PMU_0P2A_TIEH_NEG_EN_1_V  0x00000001U
#define PMU_0P2A_TIEH_NEG_EN_1_S  13
/** PMU_0P2A_TIEH_1 : R/W; bitpos: [14]; default: 0;
 *  need_des
 */
#define PMU_0P2A_TIEH_1    (BIT(14))
#define PMU_0P2A_TIEH_1_M  (PMU_0P2A_TIEH_1_V << PMU_0P2A_TIEH_1_S)
#define PMU_0P2A_TIEH_1_V  0x00000001U
#define PMU_0P2A_TIEH_1_S  14
/** PMU_0P2A_TARGET1_1 : R/W; bitpos: [22:15]; default: 64;
 *  need_des
 */
#define PMU_0P2A_TARGET1_1    0x000000FFU
#define PMU_0P2A_TARGET1_1_M  (PMU_0P2A_TARGET1_1_V << PMU_0P2A_TARGET1_1_S)
#define PMU_0P2A_TARGET1_1_V  0x000000FFU
#define PMU_0P2A_TARGET1_1_S  15
/** PMU_0P2A_TARGET0_1 : R/W; bitpos: [30:23]; default: 128;
 *  need_des
 */
#define PMU_0P2A_TARGET0_1    0x000000FFU
#define PMU_0P2A_TARGET0_1_M  (PMU_0P2A_TARGET0_1_V << PMU_0P2A_TARGET0_1_S)
#define PMU_0P2A_TARGET0_1_V  0x000000FFU
#define PMU_0P2A_TARGET0_1_S  23
/** PMU_0P2A_LDO_CNT_PRESCALER_SEL_1 : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_0P2A_LDO_CNT_PRESCALER_SEL_1    (BIT(31))
#define PMU_0P2A_LDO_CNT_PRESCALER_SEL_1_M  (PMU_0P2A_LDO_CNT_PRESCALER_SEL_1_V << PMU_0P2A_LDO_CNT_PRESCALER_SEL_1_S)
#define PMU_0P2A_LDO_CNT_PRESCALER_SEL_1_V  0x00000001U
#define PMU_0P2A_LDO_CNT_PRESCALER_SEL_1_S  31

/** PMU_EXT_LDO_P1_0P2A_ANA_REG register
 *  need_des
 */
#define PMU_EXT_LDO_P1_0P2A_ANA_REG (DR_REG_PMU_BASE + 0x1dc)
/** PMU_ANA_0P2A_MUL_1 : R/W; bitpos: [25:23]; default: 0;
 *  need_des
 */
#define PMU_ANA_0P2A_MUL_1    0x00000007U
#define PMU_ANA_0P2A_MUL_1_M  (PMU_ANA_0P2A_MUL_1_V << PMU_ANA_0P2A_MUL_1_S)
#define PMU_ANA_0P2A_MUL_1_V  0x00000007U
#define PMU_ANA_0P2A_MUL_1_S  23
/** PMU_ANA_0P2A_EN_VDET_1 : R/W; bitpos: [26]; default: 0;
 *  need_des
 */
#define PMU_ANA_0P2A_EN_VDET_1    (BIT(26))
#define PMU_ANA_0P2A_EN_VDET_1_M  (PMU_ANA_0P2A_EN_VDET_1_V << PMU_ANA_0P2A_EN_VDET_1_S)
#define PMU_ANA_0P2A_EN_VDET_1_V  0x00000001U
#define PMU_ANA_0P2A_EN_VDET_1_S  26
/** PMU_ANA_0P2A_EN_CUR_LIM_1 : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define PMU_ANA_0P2A_EN_CUR_LIM_1    (BIT(27))
#define PMU_ANA_0P2A_EN_CUR_LIM_1_M  (PMU_ANA_0P2A_EN_CUR_LIM_1_V << PMU_ANA_0P2A_EN_CUR_LIM_1_S)
#define PMU_ANA_0P2A_EN_CUR_LIM_1_V  0x00000001U
#define PMU_ANA_0P2A_EN_CUR_LIM_1_S  27
/** PMU_ANA_0P2A_DREF_1 : R/W; bitpos: [31:28]; default: 10;
 *  need_des
 */
#define PMU_ANA_0P2A_DREF_1    0x0000000FU
#define PMU_ANA_0P2A_DREF_1_M  (PMU_ANA_0P2A_DREF_1_V << PMU_ANA_0P2A_DREF_1_S)
#define PMU_ANA_0P2A_DREF_1_V  0x0000000FU
#define PMU_ANA_0P2A_DREF_1_S  28

/** PMU_EXT_LDO_P1_0P3A_REG register
 *  need_des
 */
#define PMU_EXT_LDO_P1_0P3A_REG (DR_REG_PMU_BASE + 0x1e0)
/** PMU_0P3A_FORCE_TIEH_SEL_1 : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define PMU_0P3A_FORCE_TIEH_SEL_1    (BIT(7))
#define PMU_0P3A_FORCE_TIEH_SEL_1_M  (PMU_0P3A_FORCE_TIEH_SEL_1_V << PMU_0P3A_FORCE_TIEH_SEL_1_S)
#define PMU_0P3A_FORCE_TIEH_SEL_1_V  0x00000001U
#define PMU_0P3A_FORCE_TIEH_SEL_1_S  7
/** PMU_0P3A_XPD_1 : R/W; bitpos: [8]; default: 0;
 *  need_des
 */
#define PMU_0P3A_XPD_1    (BIT(8))
#define PMU_0P3A_XPD_1_M  (PMU_0P3A_XPD_1_V << PMU_0P3A_XPD_1_S)
#define PMU_0P3A_XPD_1_V  0x00000001U
#define PMU_0P3A_XPD_1_S  8
/** PMU_0P3A_TIEH_SEL_1 : R/W; bitpos: [11:9]; default: 0;
 *  need_des
 */
#define PMU_0P3A_TIEH_SEL_1    0x00000007U
#define PMU_0P3A_TIEH_SEL_1_M  (PMU_0P3A_TIEH_SEL_1_V << PMU_0P3A_TIEH_SEL_1_S)
#define PMU_0P3A_TIEH_SEL_1_V  0x00000007U
#define PMU_0P3A_TIEH_SEL_1_S  9
/** PMU_0P3A_TIEH_POS_EN_1 : R/W; bitpos: [12]; default: 0;
 *  need_des
 */
#define PMU_0P3A_TIEH_POS_EN_1    (BIT(12))
#define PMU_0P3A_TIEH_POS_EN_1_M  (PMU_0P3A_TIEH_POS_EN_1_V << PMU_0P3A_TIEH_POS_EN_1_S)
#define PMU_0P3A_TIEH_POS_EN_1_V  0x00000001U
#define PMU_0P3A_TIEH_POS_EN_1_S  12
/** PMU_0P3A_TIEH_NEG_EN_1 : R/W; bitpos: [13]; default: 0;
 *  need_des
 */
#define PMU_0P3A_TIEH_NEG_EN_1    (BIT(13))
#define PMU_0P3A_TIEH_NEG_EN_1_M  (PMU_0P3A_TIEH_NEG_EN_1_V << PMU_0P3A_TIEH_NEG_EN_1_S)
#define PMU_0P3A_TIEH_NEG_EN_1_V  0x00000001U
#define PMU_0P3A_TIEH_NEG_EN_1_S  13
/** PMU_0P3A_TIEH_1 : R/W; bitpos: [14]; default: 0;
 *  need_des
 */
#define PMU_0P3A_TIEH_1    (BIT(14))
#define PMU_0P3A_TIEH_1_M  (PMU_0P3A_TIEH_1_V << PMU_0P3A_TIEH_1_S)
#define PMU_0P3A_TIEH_1_V  0x00000001U
#define PMU_0P3A_TIEH_1_S  14
/** PMU_0P3A_TARGET1_1 : R/W; bitpos: [22:15]; default: 64;
 *  need_des
 */
#define PMU_0P3A_TARGET1_1    0x000000FFU
#define PMU_0P3A_TARGET1_1_M  (PMU_0P3A_TARGET1_1_V << PMU_0P3A_TARGET1_1_S)
#define PMU_0P3A_TARGET1_1_V  0x000000FFU
#define PMU_0P3A_TARGET1_1_S  15
/** PMU_0P3A_TARGET0_1 : R/W; bitpos: [30:23]; default: 128;
 *  need_des
 */
#define PMU_0P3A_TARGET0_1    0x000000FFU
#define PMU_0P3A_TARGET0_1_M  (PMU_0P3A_TARGET0_1_V << PMU_0P3A_TARGET0_1_S)
#define PMU_0P3A_TARGET0_1_V  0x000000FFU
#define PMU_0P3A_TARGET0_1_S  23
/** PMU_0P3A_LDO_CNT_PRESCALER_SEL_1 : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_0P3A_LDO_CNT_PRESCALER_SEL_1    (BIT(31))
#define PMU_0P3A_LDO_CNT_PRESCALER_SEL_1_M  (PMU_0P3A_LDO_CNT_PRESCALER_SEL_1_V << PMU_0P3A_LDO_CNT_PRESCALER_SEL_1_S)
#define PMU_0P3A_LDO_CNT_PRESCALER_SEL_1_V  0x00000001U
#define PMU_0P3A_LDO_CNT_PRESCALER_SEL_1_S  31

/** PMU_EXT_LDO_P1_0P3A_ANA_REG register
 *  need_des
 */
#define PMU_EXT_LDO_P1_0P3A_ANA_REG (DR_REG_PMU_BASE + 0x1e4)
/** PMU_ANA_0P3A_MUL_1 : R/W; bitpos: [25:23]; default: 0;
 *  need_des
 */
#define PMU_ANA_0P3A_MUL_1    0x00000007U
#define PMU_ANA_0P3A_MUL_1_M  (PMU_ANA_0P3A_MUL_1_V << PMU_ANA_0P3A_MUL_1_S)
#define PMU_ANA_0P3A_MUL_1_V  0x00000007U
#define PMU_ANA_0P3A_MUL_1_S  23
/** PMU_ANA_0P3A_EN_VDET_1 : R/W; bitpos: [26]; default: 0;
 *  need_des
 */
#define PMU_ANA_0P3A_EN_VDET_1    (BIT(26))
#define PMU_ANA_0P3A_EN_VDET_1_M  (PMU_ANA_0P3A_EN_VDET_1_V << PMU_ANA_0P3A_EN_VDET_1_S)
#define PMU_ANA_0P3A_EN_VDET_1_V  0x00000001U
#define PMU_ANA_0P3A_EN_VDET_1_S  26
/** PMU_ANA_0P3A_EN_CUR_LIM_1 : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define PMU_ANA_0P3A_EN_CUR_LIM_1    (BIT(27))
#define PMU_ANA_0P3A_EN_CUR_LIM_1_M  (PMU_ANA_0P3A_EN_CUR_LIM_1_V << PMU_ANA_0P3A_EN_CUR_LIM_1_S)
#define PMU_ANA_0P3A_EN_CUR_LIM_1_V  0x00000001U
#define PMU_ANA_0P3A_EN_CUR_LIM_1_S  27
/** PMU_ANA_0P3A_DREF_1 : R/W; bitpos: [31:28]; default: 10;
 *  need_des
 */
#define PMU_ANA_0P3A_DREF_1    0x0000000FU
#define PMU_ANA_0P3A_DREF_1_M  (PMU_ANA_0P3A_DREF_1_V << PMU_ANA_0P3A_DREF_1_S)
#define PMU_ANA_0P3A_DREF_1_V  0x0000000FU
#define PMU_ANA_0P3A_DREF_1_S  28

/** PMU_EXT_WAKEUP_LV_REG register
 *  need_des
 */
#define PMU_EXT_WAKEUP_LV_REG (DR_REG_PMU_BASE + 0x1e8)
/** PMU_EXT_WAKEUP_LV : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define PMU_EXT_WAKEUP_LV    0xFFFFFFFFU
#define PMU_EXT_WAKEUP_LV_M  (PMU_EXT_WAKEUP_LV_V << PMU_EXT_WAKEUP_LV_S)
#define PMU_EXT_WAKEUP_LV_V  0xFFFFFFFFU
#define PMU_EXT_WAKEUP_LV_S  0

