espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/pmu_reg.h
/** PMU_EXT_WAKEUP_SEL_REG register
 *  need_des
 */
#define PMU_EXT_WAKEUP_SEL_REG (DR_REG_PMU_BASE + 0x1ec)
/** PMU_EXT_WAKEUP_SEL : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define PMU_EXT_WAKEUP_SEL    0xFFFFFFFFU
#define PMU_EXT_WAKEUP_SEL_M  (PMU_EXT_WAKEUP_SEL_V << PMU_EXT_WAKEUP_SEL_S)
#define PMU_EXT_WAKEUP_SEL_V  0xFFFFFFFFU
#define PMU_EXT_WAKEUP_SEL_S  0

/** PMU_EXT_WAKEUP_ST_REG register
 *  need_des
 */
#define PMU_EXT_WAKEUP_ST_REG (DR_REG_PMU_BASE + 0x1f0)
/** PMU_EXT_WAKEUP_STATUS : RO; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define PMU_EXT_WAKEUP_STATUS    0xFFFFFFFFU
#define PMU_EXT_WAKEUP_STATUS_M  (PMU_EXT_WAKEUP_STATUS_V << PMU_EXT_WAKEUP_STATUS_S)
#define PMU_EXT_WAKEUP_STATUS_V  0xFFFFFFFFU
#define PMU_EXT_WAKEUP_STATUS_S  0

/** PMU_EXT_WAKEUP_CNTL_REG register
 *  need_des
 */
#define PMU_EXT_WAKEUP_CNTL_REG (DR_REG_PMU_BASE + 0x1f4)
/** PMU_EXT_WAKEUP_STATUS_CLR : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define PMU_EXT_WAKEUP_STATUS_CLR    (BIT(30))
#define PMU_EXT_WAKEUP_STATUS_CLR_M  (PMU_EXT_WAKEUP_STATUS_CLR_V << PMU_EXT_WAKEUP_STATUS_CLR_S)
#define PMU_EXT_WAKEUP_STATUS_CLR_V  0x00000001U
#define PMU_EXT_WAKEUP_STATUS_CLR_S  30
/** PMU_EXT_WAKEUP_FILTER : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_EXT_WAKEUP_FILTER    (BIT(31))
#define PMU_EXT_WAKEUP_FILTER_M  (PMU_EXT_WAKEUP_FILTER_V << PMU_EXT_WAKEUP_FILTER_S)
#define PMU_EXT_WAKEUP_FILTER_V  0x00000001U
#define PMU_EXT_WAKEUP_FILTER_S  31

/** PMU_SDIO_WAKEUP_CNTL_REG register
 *  need_des
 */
#define PMU_SDIO_WAKEUP_CNTL_REG (DR_REG_PMU_BASE + 0x1f8)
/** PMU_SDIO_ACT_DNUM : R/W; bitpos: [9:0]; default: 1023;
 *  need_des
 */
#define PMU_SDIO_ACT_DNUM    0x000003FFU
#define PMU_SDIO_ACT_DNUM_M  (PMU_SDIO_ACT_DNUM_V << PMU_SDIO_ACT_DNUM_S)
#define PMU_SDIO_ACT_DNUM_V  0x000003FFU
#define PMU_SDIO_ACT_DNUM_S  0

/** PMU_XTAL_SLP_REG register
 *  need_des
 */
#define PMU_XTAL_SLP_REG (DR_REG_PMU_BASE + 0x1fc)
/** PMU_XTAL_SLP_CNT_TARGET : R/W; bitpos: [31:16]; default: 15;
 *  need_des
 */
#define PMU_XTAL_SLP_CNT_TARGET    0x0000FFFFU
#define PMU_XTAL_SLP_CNT_TARGET_M  (PMU_XTAL_SLP_CNT_TARGET_V << PMU_XTAL_SLP_CNT_TARGET_S)
#define PMU_XTAL_SLP_CNT_TARGET_V  0x0000FFFFU
#define PMU_XTAL_SLP_CNT_TARGET_S  16

/** PMU_CPU_SW_STALL_REG register
 *  need_des
 */
#define PMU_CPU_SW_STALL_REG (DR_REG_PMU_BASE + 0x200)
/** PMU_HPCORE1_SW_STALL_CODE : R/W; bitpos: [23:16]; default: 0;
 *  need_des
 */
#define PMU_HPCORE1_SW_STALL_CODE    0x000000FFU
#define PMU_HPCORE1_SW_STALL_CODE_M  (PMU_HPCORE1_SW_STALL_CODE_V << PMU_HPCORE1_SW_STALL_CODE_S)
#define PMU_HPCORE1_SW_STALL_CODE_V  0x000000FFU
#define PMU_HPCORE1_SW_STALL_CODE_S  16
/** PMU_HPCORE0_SW_STALL_CODE : R/W; bitpos: [31:24]; default: 0;
 *  need_des
 */
#define PMU_HPCORE0_SW_STALL_CODE    0x000000FFU
#define PMU_HPCORE0_SW_STALL_CODE_M  (PMU_HPCORE0_SW_STALL_CODE_V << PMU_HPCORE0_SW_STALL_CODE_S)
#define PMU_HPCORE0_SW_STALL_CODE_V  0x000000FFU
#define PMU_HPCORE0_SW_STALL_CODE_S  24

/** PMU_DCM_CTRL_REG register
 *  need_des
 */
#define PMU_DCM_CTRL_REG (DR_REG_PMU_BASE + 0x204)
/** PMU_DCDC_ON_REQ : WT; bitpos: [0]; default: 0;
 *  SW trigger dcdc on
 */
#define PMU_DCDC_ON_REQ    (BIT(0))
#define PMU_DCDC_ON_REQ_M  (PMU_DCDC_ON_REQ_V << PMU_DCDC_ON_REQ_S)
#define PMU_DCDC_ON_REQ_V  0x00000001U
#define PMU_DCDC_ON_REQ_S  0
/** PMU_DCDC_OFF_REQ : WT; bitpos: [1]; default: 0;
 *  SW trigger dcdc off
 */
#define PMU_DCDC_OFF_REQ    (BIT(1))
#define PMU_DCDC_OFF_REQ_M  (PMU_DCDC_OFF_REQ_V << PMU_DCDC_OFF_REQ_S)
#define PMU_DCDC_OFF_REQ_V  0x00000001U
#define PMU_DCDC_OFF_REQ_S  1
/** PMU_DCDC_LIGHTSLP_REQ : WT; bitpos: [2]; default: 0;
 *  SW trigger dcdc enter lightsleep
 */
#define PMU_DCDC_LIGHTSLP_REQ    (BIT(2))
#define PMU_DCDC_LIGHTSLP_REQ_M  (PMU_DCDC_LIGHTSLP_REQ_V << PMU_DCDC_LIGHTSLP_REQ_S)
#define PMU_DCDC_LIGHTSLP_REQ_V  0x00000001U
#define PMU_DCDC_LIGHTSLP_REQ_S  2
/** PMU_DCDC_DEEPSLP_REQ : WT; bitpos: [3]; default: 0;
 *  SW trigger dcdc enter deepsleep
 */
#define PMU_DCDC_DEEPSLP_REQ    (BIT(3))
#define PMU_DCDC_DEEPSLP_REQ_M  (PMU_DCDC_DEEPSLP_REQ_V << PMU_DCDC_DEEPSLP_REQ_S)
#define PMU_DCDC_DEEPSLP_REQ_V  0x00000001U
#define PMU_DCDC_DEEPSLP_REQ_S  3
/** PMU_DCDC_DONE_FORCE : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define PMU_DCDC_DONE_FORCE    (BIT(7))
#define PMU_DCDC_DONE_FORCE_M  (PMU_DCDC_DONE_FORCE_V << PMU_DCDC_DONE_FORCE_S)
#define PMU_DCDC_DONE_FORCE_V  0x00000001U
#define PMU_DCDC_DONE_FORCE_S  7
/** PMU_DCDC_ON_FORCE_PU : R/W; bitpos: [8]; default: 0;
 *  need_des
 */
#define PMU_DCDC_ON_FORCE_PU    (BIT(8))
#define PMU_DCDC_ON_FORCE_PU_M  (PMU_DCDC_ON_FORCE_PU_V << PMU_DCDC_ON_FORCE_PU_S)
#define PMU_DCDC_ON_FORCE_PU_V  0x00000001U
#define PMU_DCDC_ON_FORCE_PU_S  8
/** PMU_DCDC_ON_FORCE_PD : R/W; bitpos: [9]; default: 0;
 *  need_des
 */
#define PMU_DCDC_ON_FORCE_PD    (BIT(9))
#define PMU_DCDC_ON_FORCE_PD_M  (PMU_DCDC_ON_FORCE_PD_V << PMU_DCDC_ON_FORCE_PD_S)
#define PMU_DCDC_ON_FORCE_PD_V  0x00000001U
#define PMU_DCDC_ON_FORCE_PD_S  9
/** PMU_DCDC_FB_RES_FORCE_PU : R/W; bitpos: [10]; default: 0;
 *  need_des
 */
#define PMU_DCDC_FB_RES_FORCE_PU    (BIT(10))
#define PMU_DCDC_FB_RES_FORCE_PU_M  (PMU_DCDC_FB_RES_FORCE_PU_V << PMU_DCDC_FB_RES_FORCE_PU_S)
#define PMU_DCDC_FB_RES_FORCE_PU_V  0x00000001U
#define PMU_DCDC_FB_RES_FORCE_PU_S  10
/** PMU_DCDC_FB_RES_FORCE_PD : R/W; bitpos: [11]; default: 0;
 *  need_des
 */
#define PMU_DCDC_FB_RES_FORCE_PD    (BIT(11))
#define PMU_DCDC_FB_RES_FORCE_PD_M  (PMU_DCDC_FB_RES_FORCE_PD_V << PMU_DCDC_FB_RES_FORCE_PD_S)
#define PMU_DCDC_FB_RES_FORCE_PD_V  0x00000001U
#define PMU_DCDC_FB_RES_FORCE_PD_S  11
/** PMU_DCDC_LS_FORCE_PU : R/W; bitpos: [12]; default: 0;
 *  need_des
 */
#define PMU_DCDC_LS_FORCE_PU    (BIT(12))
#define PMU_DCDC_LS_FORCE_PU_M  (PMU_DCDC_LS_FORCE_PU_V << PMU_DCDC_LS_FORCE_PU_S)
#define PMU_DCDC_LS_FORCE_PU_V  0x00000001U
#define PMU_DCDC_LS_FORCE_PU_S  12
/** PMU_DCDC_LS_FORCE_PD : R/W; bitpos: [13]; default: 0;
 *  need_des
 */
#define PMU_DCDC_LS_FORCE_PD    (BIT(13))
#define PMU_DCDC_LS_FORCE_PD_M  (PMU_DCDC_LS_FORCE_PD_V << PMU_DCDC_LS_FORCE_PD_S)
#define PMU_DCDC_LS_FORCE_PD_V  0x00000001U
#define PMU_DCDC_LS_FORCE_PD_S  13
/** PMU_DCDC_DS_FORCE_PU : R/W; bitpos: [14]; default: 0;
 *  need_des
 */
#define PMU_DCDC_DS_FORCE_PU    (BIT(14))
#define PMU_DCDC_DS_FORCE_PU_M  (PMU_DCDC_DS_FORCE_PU_V << PMU_DCDC_DS_FORCE_PU_S)
#define PMU_DCDC_DS_FORCE_PU_V  0x00000001U
#define PMU_DCDC_DS_FORCE_PU_S  14
/** PMU_DCDC_DS_FORCE_PD : R/W; bitpos: [15]; default: 0;
 *  need_des
 */
#define PMU_DCDC_DS_FORCE_PD    (BIT(15))
#define PMU_DCDC_DS_FORCE_PD_M  (PMU_DCDC_DS_FORCE_PD_V << PMU_DCDC_DS_FORCE_PD_S)
#define PMU_DCDC_DS_FORCE_PD_V  0x00000001U
#define PMU_DCDC_DS_FORCE_PD_S  15
/** PMU_DCM_CUR_ST : RO; bitpos: [23:16]; default: 1;
 *  need_des
 */
#define PMU_DCM_CUR_ST    0x000000FFU
#define PMU_DCM_CUR_ST_M  (PMU_DCM_CUR_ST_V << PMU_DCM_CUR_ST_S)
#define PMU_DCM_CUR_ST_V  0x000000FFU
#define PMU_DCM_CUR_ST_S  16
/** PMU_DCDC_EN_AMUX_TEST : R/W; bitpos: [29]; default: 0;
 *  Enable analog mux to pull PAD TEST_DCDC voltage signal
 */
#define PMU_DCDC_EN_AMUX_TEST    (BIT(29))
#define PMU_DCDC_EN_AMUX_TEST_M  (PMU_DCDC_EN_AMUX_TEST_V << PMU_DCDC_EN_AMUX_TEST_S)
#define PMU_DCDC_EN_AMUX_TEST_V  0x00000001U
#define PMU_DCDC_EN_AMUX_TEST_S  29

