espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/pmu_reg.h
/** PMU_DCM_WAIT_DELAY_REG register
 *  need_des
 */
#define PMU_DCM_WAIT_DELAY_REG (DR_REG_PMU_BASE + 0x208)
/** PMU_DCDC_PRE_DELAY : R/W; bitpos: [7:0]; default: 5;
 *  DCDC pre-on/post off delay
 */
#define PMU_DCDC_PRE_DELAY    0x000000FFU
#define PMU_DCDC_PRE_DELAY_M  (PMU_DCDC_PRE_DELAY_V << PMU_DCDC_PRE_DELAY_S)
#define PMU_DCDC_PRE_DELAY_V  0x000000FFU
#define PMU_DCDC_PRE_DELAY_S  0
/** PMU_DCDC_RES_OFF_DELAY : R/W; bitpos: [15:8]; default: 2;
 *  DCDC fb res off delay
 */
#define PMU_DCDC_RES_OFF_DELAY    0x000000FFU
#define PMU_DCDC_RES_OFF_DELAY_M  (PMU_DCDC_RES_OFF_DELAY_V << PMU_DCDC_RES_OFF_DELAY_S)
#define PMU_DCDC_RES_OFF_DELAY_V  0x000000FFU
#define PMU_DCDC_RES_OFF_DELAY_S  8
/** PMU_DCDC_STABLE_DELAY : R/W; bitpos: [25:16]; default: 75;
 *  DCDC stable delay
 */
#define PMU_DCDC_STABLE_DELAY    0x000003FFU
#define PMU_DCDC_STABLE_DELAY_M  (PMU_DCDC_STABLE_DELAY_V << PMU_DCDC_STABLE_DELAY_S)
#define PMU_DCDC_STABLE_DELAY_V  0x000003FFU
#define PMU_DCDC_STABLE_DELAY_S  16

/** PMU_VDDBAT_CFG_REG register
 *  need_des
 */
#define PMU_VDDBAT_CFG_REG (DR_REG_PMU_BASE + 0x20c)
/** PMU_ANA_VDDBAT_MODE : RO; bitpos: [1:0]; default: 0;
 *  need_des
 */
#define PMU_ANA_VDDBAT_MODE    0x00000003U
#define PMU_ANA_VDDBAT_MODE_M  (PMU_ANA_VDDBAT_MODE_V << PMU_ANA_VDDBAT_MODE_S)
#define PMU_ANA_VDDBAT_MODE_V  0x00000003U
#define PMU_ANA_VDDBAT_MODE_S  0
/** PMU_VDDBAT_SW_UPDATE : WT; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_VDDBAT_SW_UPDATE    (BIT(31))
#define PMU_VDDBAT_SW_UPDATE_M  (PMU_VDDBAT_SW_UPDATE_V << PMU_VDDBAT_SW_UPDATE_S)
#define PMU_VDDBAT_SW_UPDATE_V  0x00000001U
#define PMU_VDDBAT_SW_UPDATE_S  31

/** PMU_TOUCH_PWR_CNTL_REG register
 *  need_des
 */
#define PMU_TOUCH_PWR_CNTL_REG (DR_REG_PMU_BASE + 0x210)
/** PMU_TOUCH_WAIT_CYCLES : R/W; bitpos: [13:5]; default: 10;
 *  need_des
 */
#define PMU_TOUCH_WAIT_CYCLES    0x000001FFU
#define PMU_TOUCH_WAIT_CYCLES_M  (PMU_TOUCH_WAIT_CYCLES_V << PMU_TOUCH_WAIT_CYCLES_S)
#define PMU_TOUCH_WAIT_CYCLES_V  0x000001FFU
#define PMU_TOUCH_WAIT_CYCLES_S  5
/** PMU_TOUCH_SLEEP_CYCLES : R/W; bitpos: [29:14]; default: 100;
 *  need_des
 */
#define PMU_TOUCH_SLEEP_CYCLES    0x0000FFFFU
#define PMU_TOUCH_SLEEP_CYCLES_M  (PMU_TOUCH_SLEEP_CYCLES_V << PMU_TOUCH_SLEEP_CYCLES_S)
#define PMU_TOUCH_SLEEP_CYCLES_V  0x0000FFFFU
#define PMU_TOUCH_SLEEP_CYCLES_S  14
/** PMU_TOUCH_FORCE_DONE : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define PMU_TOUCH_FORCE_DONE    (BIT(30))
#define PMU_TOUCH_FORCE_DONE_M  (PMU_TOUCH_FORCE_DONE_V << PMU_TOUCH_FORCE_DONE_S)
#define PMU_TOUCH_FORCE_DONE_V  0x00000001U
#define PMU_TOUCH_FORCE_DONE_S  30
/** PMU_TOUCH_SLEEP_TIMER_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_TOUCH_SLEEP_TIMER_EN    (BIT(31))
#define PMU_TOUCH_SLEEP_TIMER_EN_M  (PMU_TOUCH_SLEEP_TIMER_EN_V << PMU_TOUCH_SLEEP_TIMER_EN_S)
#define PMU_TOUCH_SLEEP_TIMER_EN_V  0x00000001U
#define PMU_TOUCH_SLEEP_TIMER_EN_S  31

/** PMU_RDN_ECO_REG register
 *  need_des
 */
#define PMU_RDN_ECO_REG (DR_REG_PMU_BASE + 0x214)
/** PMU_PMU_RDN_ECO_RESULT : RO; bitpos: [0]; default: 0;
 *  need_des
 */
#define PMU_PMU_RDN_ECO_RESULT    (BIT(0))
#define PMU_PMU_RDN_ECO_RESULT_M  (PMU_PMU_RDN_ECO_RESULT_V << PMU_PMU_RDN_ECO_RESULT_S)
#define PMU_PMU_RDN_ECO_RESULT_V  0x00000001U
#define PMU_PMU_RDN_ECO_RESULT_S  0
/** PMU_PMU_RDN_ECO_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_PMU_RDN_ECO_EN    (BIT(31))
#define PMU_PMU_RDN_ECO_EN_M  (PMU_PMU_RDN_ECO_EN_V << PMU_PMU_RDN_ECO_EN_S)
#define PMU_PMU_RDN_ECO_EN_V  0x00000001U
#define PMU_PMU_RDN_ECO_EN_S  31

/** PMU_DATE_REG register
 *  need_des
 */
#define PMU_DATE_REG (DR_REG_PMU_BASE + 0x3fc)
/** PMU_PMU_DATE : R/W; bitpos: [30:0]; default: 36712768;
 *  need_des
 */
#define PMU_PMU_DATE    0x7FFFFFFFU
#define PMU_PMU_DATE_M  (PMU_PMU_DATE_V << PMU_PMU_DATE_S)
#define PMU_PMU_DATE_V  0x7FFFFFFFU
#define PMU_PMU_DATE_S  0
/** PMU_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_CLK_EN    (BIT(31))
#define PMU_CLK_EN_M  (PMU_CLK_EN_V << PMU_CLK_EN_S)
#define PMU_CLK_EN_V  0x00000001U
#define PMU_CLK_EN_S  31

#ifdef __cplusplus
}
#endif
